tutorials/incompressible/simpleSolver/ras/turbineSiting/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    outlet
    {
        type            patch;
        nFaces          922;
        startFace       364825;
    }
    sides
    {
        type            patch;
        nFaces          1834;
        startFace       365747;
    }
    inlet
    {
        type            patch;
        nFaces          923;
        startFace       367581;
    }
    ground
    {
        type            wall;
        nFaces          0;
        startFace       368504;
    }
    top
    {
        type            patch;
        nFaces          900;
        startFace       368504;
    }
    terrain_patch0
    {
        type            wall;
        nFaces          14400;
        startFace       369404;
    }
)

// ************************************************************************* //
