tutorials/incompressible/simpleSolver/ras/turbineSiting/constant/RASProperties
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel            realizableKE;

turbulence          on;

printCoeffs         on;

kEpsilonCoeffs
{
    Cmu         0.09;
    C1          1.44;
    C2          1.92;
    sigmaEps    1.11; //Original value:1.44
    //NOTE: See "On the use of the k-Epsilon model in commercial CFD software
    // to model the neutral atmospheric boundary layer". J. of wind engineering
    // and inductrial aerodymanics 95(2007) 355-269 by
    // D.M. Hargreaves and N.G. Wright
}

// ************************************************************************* //
