tutorials/incompressible/simpleSolver/ras/turbineSiting/0.org/include/ABLConditions
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

Uref                 10.0;
Zref                 20;
zDir                 (0 0 1);
flowDir              (1 0 0);
z0                   uniform 0.1;
zGround              uniform 935.0;

// ************************************************************************* //
