tutorials/incompressible/simpleSolver/ras/turbineSiting/0.org/include/initialConditions
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

flowVelocity         (0 0 0);
pressure             0;
turbulentKE          1.3;
turbulentEpsilon     0.01;

// ************************************************************************* //
